Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.WallsOverlap
Walls overlap. Consider embedding walls, editing their extents or profile to avoid overlapping.

Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.ViewDetailLevelIsHighInLargeView
A large view has view detail level set to medium or coarse. Generation of extraneous details harms performance.

Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.UnusedTypesInTheProject
Project contains unused families and/or types. Consider purging them out.

Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.UnjoinedRoomSeparationLinesFound
Room Separation  of <element> is not joined, might cause performance issue with room boundaries computations.

Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.TooManyElementsInSketch
Sketch of <element> contains too many objects - it may take long time to solve.

Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.TooManyAreaBoundaryLinesFound
There are too many  area boundary lines in area scheme <element> might result in increased model sizes on disk and in memory. Please investigate if area scheme is used in a proper way.

Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.TooLargeSketch
Sketch of <element> has large area - it may slow down selection, drawing and geometric computations.

Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.MultipleLoopsInSketch
Sketch of <element> contains multiple independent loops - splitting it in few independent elements might improve performance.

Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.ManyUnusedNestedFamilies
Family contains other families loaded into it but not used. Consider purging family document from unused families and types.

Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.ManyElementInFamily
Family definition contains too many elements. Consider simplification of the family.

Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.LargeFamilyFile
Family occupies XXX kilobytes of memory. Consider simplification of the family.

Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.InteriorCategoriesEnabledInLargeView
Interior categories are enabled in a large view. Even though these objects may be obscured and invisible,
they still have negative impact on performance.

Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.HostHasTooManyInserts
Host object contains too many cutting inserts - it may take long time to update. Consider splitting host object into smaller pieces or using stacked walls.

Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.FamilyContainsViewSpecificImports
Family definition contains view-specific imports. Such imports are inaccessible in the project - consider removal.

Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.DuplicateInstances
There are duplicate instances of the same family in the same place. Delete duplicate instances to improve performance.

Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.DisjoinedSolidsInInPlaceFamily
In-place family contains multiple disjoined solids. Consider splitting in several in-place families.

Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.ClippingIsDisabled
View has clipping disabled. It causes view to draw too many elements.

Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures
Failures which give hints pointing to situations where performance could be improved.